# Worldwide Billionaire Analysis


References
- https://thecleverprogrammer.com/2021/06/24/billionaires-analysis-with-python/
- https://thecleverprogrammer.com/2021/02/09/best-data-sources-for-data-science-projects-and-case-studies/

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
billionaires_data = pd.read_csv("https://raw.githubusercontent.com/amankharwal/Website-data/master/Billionaire.csv")
billionaires_data.head()

,Name,NetWorth,Country,Source,Rank,Age,Industry
0,Jeff Bezos,$177 B,United States,Amazon,1,57.0,Technology
1,Elon Musk,$151 B,United States,"Tesla, SpaceX",2,49.0,Automotive
2,Bernard Arnault & family,$150 B,France,LVMH,3,72.0,Fashion & Retail
3,Bill Gates,$124 B,United States,Microsoft,4,65.0,Technology
4,Mark Zuckerberg,$97 B,United States,Facebook,5,36.0,Technology

In [ ]:
billionaires_data.shape

(2755, 7)

In [ ]:
billionaires_data.columns

Index(['Name', 'NetWorth', 'Country', 'Source', 'Rank', 'Age', 'Industry'], dtype='object')

In [ ]:
billionaires_data.isnull().sum()

Name         0
NetWorth     0
Country      0
Source       0
Rank         0
Age         79
Industry     0
dtype: int64

In [ ]:
billionaires_data.loc[billionaires_data.Age.isnull() == True]

,Name,NetWorth,Country,Source,Rank,Age,Industry
132,Hinduja brothers,$14.9 B,United Kingdom,diversified,133,NaN,Diversified
255,Lam Wai-ying,$9.1 B,Hong Kong,smartphone screens,256,NaN,Manufacturing
268,Chan Tan Ching-fen,$8.8 B,Hong Kong,real estate,269,NaN,Real Estate
285,Anthony von Mandl,$8.7 B,Canada,alcoholic beverages,274,NaN,Food & Beverage
294,Kuldip Singh & Gurbachan Singh Dhingra,$8.4 B,India,paints,294,NaN,Manufacturing
...,...,...,...,...,...,...,...
2580,Lai Baosheng,$1.1 B,China,consumer technology,2524,NaN,Technology
2639,Tseng Sing-ai,$1.1 B,Taiwan,petrochemicals,2524,NaN,Manufacturing
2680,Carmen Daurella Aguilera,$1 B,Spain,Coca-Cola bottler,2674,NaN,Food & Beverage
2714,Michael McCain,$1 B,Canada,packaged meats,2674,NaN,Food & Beverage
2720,Maria Pinheiro,$1 B,Brazil,supermarkets,2674,NaN,Fashion & Retail

In [ ]:
billionaires_data = billionaires_data.dropna()

In [ ]:
billionaires_data.shape

(2676, 7)

In [ ]:
billionaires_data.NetWorth = billionaires_data.NetWorth.str.strip("$")
billionaires_data.NetWorth = billionaires_data.NetWorth.str.strip("B")
billionaires_data.NetWorth = billionaires_data.NetWorth.astype(float)
billionaires_data.NetWorth.head(10)

0    177.0
1    151.0
2    150.0
3    124.0
4     97.0
5     96.0
6     93.0
7     91.5
8     89.0
9     84.5
Name: NetWorth, dtype: float64

In [ ]:
top_10 = billionaires_data.sort_values(by='NetWorth', ascending=False).head(10)
top_10

,Name,NetWorth,Country,Source,Rank,Age,Industry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,Technology
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,Automotive
2,Bernard Arnault & family,150.0,France,LVMH,3,72.0,Fashion & Retail
3,Bill Gates,124.0,United States,Microsoft,4,65.0,Technology
4,Mark Zuckerberg,97.0,United States,Facebook,5,36.0,Technology
5,Warren Buffett,96.0,United States,Berkshire Hathaway,6,90.0,Finance & Investments
6,Larry Ellison,93.0,United States,software,7,76.0,Technology
7,Larry Page,91.5,United States,Google,8,48.0,Technology
8,Sergey Brin,89.0,United States,Google,9,47.0,Technology
9,Mukesh Ambani,84.5,India,diversified,10,63.0,Diversified